###############################################################################
# Created by write_sdc
# Thu Oct 23 08:52:58 2025
###############################################################################
current_design fa16
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name core_clock -period 6.1500 [get_ports {CLK}]
set_propagated_clock [get_clocks {core_clock}]
###############################################################################
# Environment
###############################################################################
###############################################################################
# Design Rules
###############################################################################
