###############################################################################
# Created by write_sdc
# Thu Oct 23 11:57:10 2025
###############################################################################
current_design ksa
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name core_clock -period 4.9300 [get_ports {CLK}]
set_propagated_clock [get_clocks {core_clock}]
###############################################################################
# Environment
###############################################################################
###############################################################################
# Design Rules
###############################################################################
