###############################################################################
# Created by write_sdc
# Thu Oct 23 11:57:46 2025
###############################################################################
current_design bka
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name core_clock -period 4.7500 [get_ports {CLK}]
set_propagated_clock [get_clocks {core_clock}]
###############################################################################
# Environment
###############################################################################
###############################################################################
# Design Rules
###############################################################################
